import BannerSection from './_sections/banner';
import NewsItem, {NewsItemProps} from './components/news-item';

const listOfNews: NewsItemProps[] = [
  {
    id: '1',
    title: 'معرض CES 2023: أحدث الابتكارات في مجال التكنولوجيا',
    description: 'يعد معرض CES 2023 منصة عالمية لعرض أحدث الابتكارات في مجال التكنولوجيا، حيث يشارك فيه العديد من الشركات الرائدة في صناعة الإلكترونيات والتقنيات الحديثة.',
    date: '2023-01-01'
  },
  {
    id: '2',
    title: 'تدشين منصه جمعية الحاسوب لكلية الهندسة',
    description: 'تم بحمد الله تدشين منصة جمعية الحاسوب لكلية الهندسة',
    date: '2023-01-02'
  },
  {
    id: '3',
    title: 'ورشة عمل حول الذكاء الاصطناعي وتعلم الآلة',
    description: 'تم عقد ورشة عمل حول الذكاء الاصطناعي وتعلم الآلة، حيث تم استعراض أحدث التقنيات والتطبيقات في هذا المجال.',
    date: '2023-01-03'
  },
  {
    id: '4',
    title: 'إطلاق تطبيق جديد لإدارة المشاريع',
    description: 'تم إطلاق تطبيق جديد يهدف إلى تسهيل إدارة المشاريع وتحسين التعاون بين الفرق المختلفة.',
    date: '2023-01-04'
  },
  {
    id: '5',
    title: 'مسابقة البرمجة السنوية للطلاب',
    description: 'تم تنظيم مسابقة البرمجة السنوية للطلاب، حيث شارك العديد من الطلاب في حل تحديات برمجية متنوعة.',
    date: '2023-01-05'
  },
  {
    id: '6',
    title: 'ندوة حول الأمن السيبراني وحماية البيانات',
    description: 'تم عقد ندوة حول الأمن السيبراني وحماية البيانات، حيث تم مناقشة التحديات والتهديدات الحالية في هذا المجال.',
    date: '2023-01-06'
  },
  {
    id: '7',
    title: 'إطلاق منصة تعليمية جديدة عبر الإنترنت',
    description: 'تم إطلاق منصة تعليمية جديدة عبر الإنترنت تهدف إلى تقديم محتوى تعليمي متنوع للطلاب والمعلمين.',
    date: '2023-01-07'
  }
];
const page = () => {
  return (
    <div className='custom-container'>
      <BannerSection />
      <div className='mt-10 grid grid-cols-1 gap-4 sm:grid-cols-2 lg:grid-cols-3'>
        {listOfNews.map((news, index) => (
          <NewsItem key={index} {...news} />
        ))}
      </div>
    </div>
  );
};

export default page;
